{"DApp":{"title":"DApp","links":["Notes/Smart-Contracts"],"tags":[],"content":"When you use the blockchain, you need a decentralised app, all of these have Smart Contracts and are the building blocks for DApps"},"Misc/Books/1984":{"title":"1984","links":[],"tags":[],"content":""},"Misc/Books/To-Read":{"title":"To Read","links":[],"tags":[],"content":""},"Notes/About-Me":{"title":"About Me","links":[],"tags":[],"content":"\nWho Am I?\n\nI’m Izak, a second year student studying at Aston University. I decided to make this page to help with how I study, proof of work and also help you, the viewer, with Cyber Security and other related work."},"Notes/Anonymous":{"title":"Anonymous","links":[],"tags":[],"content":"Hidden identity, nobody knows who you are, scary!"},"Notes/Block-Reward":{"title":"Block Reward","links":["Notes/Mining-Node"],"tags":[],"content":"If a miner is successful, they can receive the currency, but it is only for one node/person and is extremely power hungry."},"Notes/Block":{"title":"Block","links":[],"tags":[],"content":"It’s a data structure used to keep a set of transactions (It can have 5 10 15 transactions together, that’s how we write it in block, how many in blocks? it depends)"},"Notes/Chain":{"title":"Chain","links":[],"tags":[],"content":"Sequence of blocks in a specific order.\nYou maintain the order due to the structure of hash with the previous blocks, one thing changed, the entire thing does. It’s vital (like a chain on a bike, “if it ain’t right, it don’t work”)"},"Notes/Consensus-Algorithm":{"title":"Consensus Algorithm","links":["Notes/Consensus","Notes/Node-Application","Notes/Consensus-Algorithm","Notes/Node","Notes/Timestamp"],"tags":[],"content":"A set of rules and arrangements that are carried out in blockchains with Consensus, tends to be part of the Node Application\nBlockchain changes its state from one to another due to evolving data records and transactions as time passes\nIt is the backbone of blockchain which enables users to be able to interact with each other in a trustless manner.\nGenerally, participants/nodes in the network are incentivised to verify transactions through rewards.\nEach blockchain Consensus Algorithm works differently, one thing is clear in any Consensus process\nEnsures that all participant Node must come to an agreement when the majority of people agree on what data to write at what time with the Timestamp"},"Notes/Consensus":{"title":"Consensus","links":[],"tags":[],"content":"Consensus (Unanimous) is where everyone must agree to the validation of each record."},"Notes/Distributed-Ledger":{"title":"Distributed Ledger","links":["Notes/Consensus"],"tags":[],"content":"Database, a shared coipy of a ledger is provided to each member, nobody can edit it unless consent is given by everyone due to the consensus"},"Notes/Encryption/Decentralise":{"title":"Decentralise","links":[],"tags":[],"content":"\n\tDecentralisation is where no central authority exists, no one person controls the system! This is great because it is secure, more anonymous and still can process, validate and authenticate transactions. It additionally is transparent and everyone can see what is going on, meaning no closed source shenanigans can happen :D\n"},"Notes/Encryption/Distributed-Ledger-Technology-(DLT)":{"title":"Distributed Ledger Technology (DLT)","links":["Notes/Encryption/Decentralise"],"tags":[],"content":"\nDLT is a decentralised system (Which eliminates the need for central authority) of protocols and technology that allows multiple PCs that are nodes in different locations to propose, validate and update transactions across a network. They’re synchronised and maintained in a shared distributed database that exists across various locations to ensure transparency and security, all transactions and records in the DLT are timestamped and given a unique cryptographic signature (Hash) basically unencryptable thingumabobs for the time being (until quantum computing properly comes along lol)\n\nTo summarise it, DLT is basically a distributed database, state of multiple sites geographically and is not stored, validated or governed by any one person, it’s open and transparent!\nFeatures:\nIt is verifiable and auditable history\nDespite decentralised in nature, when the implementer of DLT has greater control over how it is actually implented\n^ Basically that shit is essneitally saying the developers have control how it’s implemented, during the silk road, one of the original developers of BTC was able to make a leak through the silk road in which he funneled 100s of millions of dollars, (he was caught by the FBI though in the end)\nDistributed ledgers are mostly permissioned databases\nDLT is very similar to the (blockchain)\nUnlike Blockchain, DLT doesn’t necessarily require having a data structure (like the block thing with the previous hash) in blocks."},"Notes/Encryption/Structure-of-the-blockchain":{"title":"Structure of the blockchain","links":[],"tags":[],"content":"Each block chain contains data hash and previous hashes\n\nFirst thing that happens is the transactions are stored inside the first block dependent on the type of blockchain\nHash is then calculated per block with a unique identity of that block to maintain security and integrity and to be aware if any changes have been made\nFinally, the previous hash is included per block to create a chain of blocks (In the name, blockchain XD) and provide tamper proof security, which is vital to stop people from exploiting it.\n\n(cool fact) First ever block is known as genesis block which didn’t have any previous hash value and therefore is considered zero.\nBlockchain is always a sequence\nBlockchain is a type of DLT and duplicated and distributed across the entire network since it’s distributed via nodes and other PC systems.\nHash is to check and insure the integrity of data\nYou want to check whether your data is in check or not, is it modified, in transit or? You can always determine by checking the hash value\nOne thing is clear: If something changes, a SINGLE bit! In that block of data, the hash will be completely different (COOL  AS FUCK!)\nIt will tell you if it is clear or not\nprevious and normal, why are we doing them together?\nIt’s very simple, any hash from previous block will become the previous hash of the next block\nDLT is super robust and secure, how? let’s say a hacker or threat actor wants to modify the block.\nBlockchain has got thousands of blocks, you can change the hash run\nonce you change hash 1, this hash is going to effect another hash, it’ll effect the value the other block, and then the next one, and the next, AND THE NEXT, ANNMNNDD THE NEXTTTT (and so on)\nSo it’ll affect the entire blockchain since you’re passing the previous hash to the next block. It’s a domino effect and it seems to be extremely secure\nEach block in the chain contains a number of transactions and every time a new transaction occurs, a record is added to everybody’s ledger in the form of a new block.\nAgain, timestamped and (immutable) (cryptographic) signatures called a hash.\nBlockchains use a consensus algorithm\nThe records cannot be changed unless all those are verifying the transaction agree to the changes. It cannot be manipulated. Makes it highly secure and vastly less susceptible to attacks than centralised networks.\nIf you’re confused:\n\nI’m assuming that the previous hash is modifying the next block similar to (X) encryption\n\nA public blockchain should be open, neutral, censorship resistant and borderless.\nDLT vs blockchain\nThey are similar but not the same.\nBoth are developed to record info in a way that makes it impossible or difficult to change, hack, or cheat the system.\nBoth are referred to as record of info that is distributed around the world or people\nOBth are generally decentralised which isn’t governed centr\n\n\nBlockchain is a sequence whereas DLT doesn’t require data structures in blocks\nblockchains are public anyone can view it. Whereas DLT which has some restrictions on who can use and access it and who can operate as a nodes\nSummary, blockchain is a type of DLT, but DLT is not neccessarily a blockchain (What?)\nDoesn’t matter if you went for the last block, if it’s important it’s hard to go on the last block, they need access and info on the blockchain, they can’t just go on the last block, we need to have some basic info on that looks straightforward on a diagram, but different in reality.\nCool as fuck features of blockchain:\n\nYou can change it, but it requires validation (immutiable) so needs consensus"},"Notes/Full-Node":{"title":"Full Node","links":[],"tags":[],"content":"The system that maintains the entire copy of the blockchain, it’s extremely important. This has heavy responsibility as it has the complete blockchain on it which allows it to distribute copies of the entire blockchain to other nodes as well. It additionally ensures validating the history of the blockchain."},"Notes/Hello-World!/Index":{"title":"Index","links":[],"tags":[],"content":"WHERE AM I? D:"},"Notes/Immutiable":{"title":"Immutiable","links":[],"tags":[],"content":"Immutability is when something can’t be changed or edited.\nAnything that has already been done are irreversible and can’t be changed.\nSo you cannot edit it, it’s impossible, sorry :(."},"Notes/Light-Node":{"title":"Light Node","links":[],"tags":[],"content":"They connect to the blockchain to the (full node) but do not keep a copy of the entire blockchain as their processing power is far more limited usually and cannot do everything since they don’t have the entire copy. It needs to connect to the full node before it can interact with the blockchain like sending or receiving a transaction."},"Notes/Member-Node":{"title":"Member Node","links":[],"tags":[],"content":"It can only initiate and receive transactions in a blockchain. like a light node"},"Notes/Mining-Node":{"title":"Mining Node","links":[],"tags":[],"content":"Most powerful, can produce blocks for the blockchain which means it’s extremely strong, if you have a mining node, it can do anything.\nThe reason it’s so hard to mine crypto is because the blockchain is so big."},"Notes/Mining-in-crypto":{"title":"Mining in crypto","links":["Notes/Full-Node","Notes/Super-Node","Notes/Mining-Node"],"tags":[],"content":"Mining is the process to determin the validatiy of the block, while creating new blocks, transactions are verified then added to the blockchain and to the Full Node and Super Node\nIt is done by miners, they get incentives by getting coins when mining. problem is many ppl mine, suddenly your mindset changes when it comes to the money. Everybody gets money, everybody makes block. It’d flood it, in BTC, the block is edited, average time, so it takes 10 minutes in BTC to add the block.\nThey limit, the delegiraty\nOtherwise it’d get flooded and devalued, there’s a process to determine and make the mining difficult.\nYou want to make 100 coins per block, the difficulty is the task that they have given to you, what they’ve said “Okay, we have given you the puzzle to all of you, but you have to solve this puzzle in order to win the race.” So you all create the block, only one person gets the coin when they push their block first. This puzzle takes a lot of time, it’s not just time, in BTC, it takes a lot of electricity, power to do this task and for us, that is impossible for us to do it as we don’t have anywhere near enough processing power. It is extremely difficult for an ordinary person.\nThat’s why this process cannot be done by every user unless you’ve got that infrastructure.\nBTC electricity requirement and infrastructure requires around 150 KW hours, far too much. 7% of the world electricity\nThere are many countries like argentina that consume less power as a country than this!\nOnly one lucky miner will get to push the block and get the reward, the others can check if they’ve done the correct thing or not\n"},"Notes/Networking/Broadcast-Address":{"title":"Broadcast Address","links":["Notes/Networking/Subnetting/Subnet-Mask"],"tags":[],"content":"Broadcast address, which is at the end of the Subnet Mask at 255, essentially is used to communicate between all devices on a network\nFun example:\nDevice: “Hey, CAN SOMEONE SAY SOMETHING???”\nSends a broadcast address to the DHCP server\nthe 23 devices on the network:\n\n“HALLO, HALLO, HALLO!!!! :DDDD”\n(obviously it’ll only be one request and it’ll be the DHCP server)\nIt replies with all included IP addresses assigned to the different addresses\nCool diagram for it:\n\n"},"Notes/Networking/IP-Addresses":{"title":"IP Addresses","links":["Notes/Networking/Subnetting/Subnet-Mask"],"tags":[],"content":"Subnet Mask"},"Notes/Networking/Subnetting/Subnet-Mask":{"title":"Subnet Mask","links":["Notes/Networking/Broadcast-Address"],"tags":[],"content":"Subnet masking is where you divide the IP into two parts, one for the host, other for the network\n10.0.0.0\n255.0.0.0\nmeans that 10 cannot be modified, but the rest can.\nThe reason? You’re doing this subnet mask dependant upon how many devices you have in your household or place, each device needs an ip, therefore you may need to expand the network.\nIt only goes up to 256, 2 are already allocated, one for the Broadcast Address 192.168.0.255 and another for the (network address) 192.168.0.0"},"Notes/Node-Application":{"title":"Node Application","links":[],"tags":[],"content":"If you want to use blockchain, you need to download their app, each of them have their own blockchain, then you can connect your computer as a node for their blockchain, you need to run and install their specific one as they have a ecosystem if you wish to participate"},"Notes/Node":{"title":"Node","links":["Notes/Full-Node","Notes/Super-Node","Notes/Light-Node","Notes/Member-Node","Notes/Validator-Node","Notes/Mining-Node","Notes/Node-Application"],"tags":[],"content":"A computer, like a cog, in a larger network, it’s a connection along many network devices and can be any type of internet device (like a switch, laptop or phone)\nIn blockchain (Nodes will host ledgers and smart contracts where transactions are executed and validated in distributed)\nThe device can receive and send data from one device to another.\nNote: A node can only perform different roles depending on the type of blockchain (e.g. a fill node can be a super node) :D\nOther definitions:\nFull Node\nSuper Node\nLight Node\nMember Node\nValidator Node\nMining Node\nNode Application\nIn different block chains, you don’t need to have all of these, different ones for different blockchain\n"},"Notes/Secure":{"title":"Secure","links":[],"tags":[],"content":"Means a file or thing is encrypted and difficult to change, edit or attack, whatever it is that is malicious."},"Notes/Smart-Contracts":{"title":"Smart Contracts","links":[],"tags":[],"content":"Smart contracts are small programs made to observe, accomplish and implement agreements automatically\nIt’s an agreement that ensures the conditions are followed and respected.\nE.g. if you made a bet, saying you’d make £20 if they lose, this would ensure that it is validated. If the opposing cheats, this will ensure that this won’t happen. So the smart contracts is essentially a common understanding about rules and processes are reached and defined.\nIt’s smart since it’ll automatically execute transactions when certain conditions or rules have been met.\nIt has an unchangeable digital agreement, making it super secure and tamper-resistance.\n"},"Notes/Super-Node":{"title":"Super Node","links":[],"tags":[],"content":"It’s a (full node) meaning it has the copy, but it’s slightly super, STRONG!\nWorks around the clock, full nodes don’t tend to work 24/7, but this is a full node, just constant run time and it’s job is to provide the most up to date version of the blockchain"},"Notes/Timestamp":{"title":"Timestamp","links":[],"tags":[],"content":"A date recorded on when something happened! :)"},"Notes/Transaction-in-blockchains":{"title":"Transaction in blockchains","links":["Notes/Consensus"],"tags":[],"content":"\nIt is an event where the state of the blockchain is updated after a transaction has happened, a timestamp and record is made of who owes who how much crypto and is the smallest and basic part of the system. Must be validated and agreed with all parties due to the consensus\n"},"Notes/Untitled":{"title":"Untitled","links":[],"tags":[],"content":"Pick one consensus algorithm"},"Notes/Validator-Node":{"title":"Validator Node","links":[],"tags":[],"content":"Received and initiate and validate a transaction, little bit better of emmber more permission"},"Notes/testt":{"title":"testt","links":[],"tags":[],"content":"\n\n\n\n\n\nConsensus: youtube.com/watch\nWhen is it due: check file pls\n\n"},"Trustless-Manner":{"title":"Trustless Manner","links":[],"tags":[],"content":"You don’t need to know any individual person to agree on an issue, it’s okay since the majority agrees on something. A democratic vote."},"index":{"title":"Welcome to my notes!","links":[],"tags":[],"content":"Who Am I?\n\nI’m Izak, a second year Cyber Security student studying at Aston University. I decided to make this page to help with how I study, proof of work, random stuff and also to help you, the viewer, with Cyber Security and other related work.\nI am currently working towards my CompTIA A+ Certification."}}