[
  "obsidian-tasks-plugin",
  "calendar",
  "obsidian-advanced-slides",
  "obsidian-outliner",
  "obsidian-projects",
  "obsidian-checklist-plugin",
  "obsidian-emoji-toolbar",
  "buttons",
  "obsidian-banners",
  "obsidian-tracker",
  "obsidian-dice-roller",
  "cmenu-plugin",
  "folder-note-plugin",
  "listen-up",
  "longform",
  "obsidian-style-settings",
  "omnisearch",
  "homepage",
  "templater-obsidian",
  "obsidian-excalidraw-plugin",
  "obsidian-theme-design-utilities",
  "various-complements",
  "url-into-selection",
  "obsidian-book-search-plugin",
  "dataview",
  "cmdr"
]